#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# @Date    : 2021/11/26 3:37 下午
# @Author  : HuiQing Yu

epic = ['正向永续', '反向永续', '反向交割']
features = [
    {
        "feature": "01 开户",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "02 资金划转",
        "story": ["00 P0级用例","01 外部划转","02 母子划转"]
    },
    {
        "feature": "03 全部策略订单",
        "story": ["00 P0级用例","01 限价委托","02 计划委托","03 跟踪委托","04 网格交易","05 止盈止损"]
    },
    {
        "feature": "04 杠杆",
        "story": ["00 P0级用例","01 杠杆切换"]
    },
    {
        "feature": "05 MGT",
        "story": ["00 P0级用例","01 财务","02 转账"]
    },
    {
        "feature": "06 撮合",
        "story": ["00 P0级用例","01 委托单","02 爆仓单","03 撤单","04 结算单"]
    },
    {
        "feature": "07 行情",
        "story": ["00 P0级用例","01 聚合行情","02 深度图&Overview","03 增量","04 深度","05 成交","06 K线"]
    },
    {
        "feature": "08 指数基差",
        "story": ["00 P0级用例","01 基差K线","02 指数K线","03 标记价格","04 溢价指数","05 预测资金费率"]
    },
    {
        "feature": "09 订单推送",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "10 爆仓",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "11 结算交割",
        "story": ["00 P0级用例","01 资金费率"]
    },
    {
        "feature": "12 指数",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "13 定序",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "14 质押借币",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "15 警报",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "16 品种生命周期",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "17 初始化",
        "story": ["00 P0级用例",]
    },
    {
        "feature": "18 API",
        "story": ["00 P0级用例","01 Schema"]
    }
]
